cf/Documents/ОплатаИмпорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОплатаИмпорт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыИмпорт</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказамПоставщику</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыПоИнвойсу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопрасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДопрасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ОплатыИмпорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатыИмпорт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ОплатаИмпорт/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	
	Запрос = Новый Запрос(
			 
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
		
	// ОПЛАТА ПО ИМПОРТУ
		
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияРасход 	ВидДвижения,
	|	Инвойс,
	|   СУММА(Сумма)        Сумма
	|ИЗ
	|	Документ.ОплатаИмпорт.РасшифровкаСуммы
	|ГДЕ
	|	Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО Ссылка, Инвойс
	|;
	
	// ОПЛАТЫ ПО ИНВОЙСУ
	
	|ВЫБРАТЬ
	|	&Период			Период,
	|	Инвойс,
	|   СУММА(Сумма)	Сумма,
	|	СУММА(СуммаУпр) СуммаУпр
	|ИЗ
	|	Документ.ОплатаИмпорт.РасшифровкаСуммы
	|ГДЕ
	|	Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО Ссылка, Инвойс
	|;
	
	// ДОЛГИ ПО ЗАКАЗАМ ПОСТАВЩИКУ
	
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияРасход 	ВидДвижения,
	|	Ссылка.Контрагент	Контрагент,
	|	ЗаказПоставщику,
	|   Сумма
	|ИЗ
	|	Документ.ОплатаИмпорт.РасшифровкаСуммы
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ДОЛГИ ПО ИНВОЙСАМ
	
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияРасход 	ВидДвижения,
	|	Ссылка.Контрагент	Контрагент,
	|	ЗаказПоставщику,
	|	Инвойс,
	|   Сумма
	|ИЗ
	|	Документ.ОплатаИмпорт.РасшифровкаСуммы
	|ГДЕ
	|	Ссылка = &Ссылка
	|	
	|");
	
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("Валюта", 			Ссылка.Валюта);

	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);

	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("ОплатыИмпорт", 	Пакет[1].Выгрузить());
  	ДополнительныеСвойства.Вставить("ОплатыПоИнвойсу", 	Пакет[2].Выгрузить());
   	ДополнительныеСвойства.Вставить("ДолгиПоЗаказамПоставщику", 	Пакет[3].Выгрузить());
    ДополнительныеСвойства.Вставить("ДолгиПоИнвойсам", 	Пакет[4].Выгрузить());
                 
КонецПроцедуры
Функция ЗаполнитьРасшифровкуСуммы(Дата, Знач Сумма, Знач СуммаУпр) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 
	|	Инвойс,
	|	СуммаОстаток 			Сумма
	|ИЗ 
	|	РегистрНакопления.ОплатыИмпорт.Остатки(&Период,)
	|УПОРЯДОЧИТЬ ПО Инвойс.Дата");
	           
	Запрос.УстановитьПараметр("Период", Дата);
	
	Оплаты = Новый ТаблицаЗначений;
	Оплаты.Колонки.Добавить("Инвойс");
	Оплаты.Колонки.Добавить("Сумма");
	Оплаты.Колонки.Добавить("СуммаУпр");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СколькоРаспределить =  Сумма; 
	СколькоРаспределитьРуб = СуммаУпр;
	Коэффициент  =  ?(СуммаУпр >0, СколькоРаспределитьРуб/СколькоРаспределить, 0);
	Пока Выборка.Следующий() Цикл
		НовСтрока = Оплаты.Добавить();
		НовСтрока.Инвойс = Выборка.Инвойс;
		
		Если Выборка.Сумма >= СколькоРаспределить Тогда
			НовСтрока.Сумма = СколькоРаспределить;
			НовСтрока.СуммаУпр = Коэффициент*НовСтрока.Сумма;
			Прервать;
		Иначе
			НовСтрока.Сумма = Выборка.Сумма;
			НовСтрока.СуммаУпр = Коэффициент*НовСтрока.Сумма;
			СколькоРаспределить = СколькоРаспределить - НовСтрока.Сумма;
		КонецЕсли;
	 КонецЦикла;
	 
	 Возврат Оплаты;
	 
КонецФункции
